EDT_Test/src/Catalogs/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНоменклатуры</name>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдинициИзмеренияДляОтчетов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT_Test/src/Catalogs/ВидыНоменклатуры/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	Элементы.ЕдиницаИзмерения.Видимость = Не Объект.Услуга;
	Элементы.ЕдинициИзмеренияДляОтчетов.Видимость = Не Объект.Услуга;
	Элементы.СсылкаАлкогольнаяПродукция.Видимость = Не Объект.Услуга;
	Элементы.СсылкаИспользоватьСерии.Видимость = Не Объект.Услуга;
КонецПроцедуры
